#ifndef TRANSMISSION_H
#define TRANSMISSION_H

#include "stdio.h"
#include <WinSock2.h>
#define  BUFFER_SIZE		SO_MAX_MSG_SIZE	/*默认缓冲区大小*/
#define  DEF_PORT			10000			/*默认端口*/

#pragma	comment(lib, "ws2_32.lib")

/************************************************************************/
/* 创建一个监听套接字并把本地套接字地址绑定到该监听套接字                   */
/************************************************************************/
SOCKET BindListen(void);

/************************************************************************/
/* 接受客户端的连接请求                                                  */
/************************************************************************/
SOCKET AccepctConnection(SOCKET hListenSocket);

/************************************************************************/
/* 接收客户端操作请求并返回操作结果 (失败返回-1)                           */
/************************************************************************/
int ProcessConnection(SOCKET hClientSocket);

/************************************************************************/
/* 关闭当前客户端连接 (失败返回-1)                                        */
/************************************************************************/
int ShutdownConnection(SOCKET hClientSocket);

/************************************************************************/
/* 服务器主函数                                                          */
/************************************************************************/
void DoWork(void);

#endif